### 1.Endeksi alfabenin ilk 10 harfi olan ve ilk 10 asal sayıyı ve ilk 10 fibonacci sayısını içeren bir veri çerçevesi oluşturun.

In [29]:

asal = []
for i in range(1,24):
    
    for k in range(2,i):
        if i%k==0:
            break
    else:
        asal.append(i)
print(asal)

[1, 2, 3, 5, 7, 11, 13, 17, 19, 23]

In [27]:
f_list = []

sayi1=0
sayi2=1
f_list.append(sayi2)

for i in range(1,10):
    sayi1,sayi2=sayi2,(sayi1+sayi2)
    f_list.append(sayi2)
    
print(f_list)

[1, 1, 2, 3, 5, 8, 13, 21, 34, 55]

In [34]:
import pandas as pd
alf = ["A","B","C","D","E","F","G","H","I","J"]
df = pd.DataFrame(index=alf)

In [32]:
df["Asal"] = asal
df["Fibonacci"] = f_list
df

   Asal  Fibonacci
A     1          1
B     2          1
C     3          2
D     5          3
E     7          5
F    11          8
G    13         13
H    17         21
I    19         34
J    23         55

### 2.Kaggle'dan Titanic: Machine Learning from Disaster isimli yarışmanın train.csv isimli dosyasını indirin ve Pandas veri çerçevelerini kullanarak tüm veriyi yükleyin. Veri çerçevelerinin .groupby() metodunu kullanarak yolcuların ortalama yaşlarını herbir cinsiyet için ayrı olacak şekilde hesaplayın.

In [38]:
df1 = pd.read_csv("titanic_train")
df1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [47]:
df1.groupby("Sex")[["Age"]].mean()

              Age
Sex
female  27.915709
male    30.726645

### 3.Koşullu seçim yöntemlerini de kullanarak, 30 yaşından küçük tüm yolcuların kurtulma oranını (survival ratio) hesaplayın. Daha sonra, kurtulma oranını cinsiyete göre ayrı ayrı hesaplayın.

In [53]:
df1[df1["Age"] < 30]["Survived"].mean() * 100

40.625

In [61]:
df1[(df1["Sex"]=="male") & (df1["Age"] < 30)]["Survived"].mean() *100

21.518987341772153

In [63]:
df1[(df1["Sex"] == "female") & (df1["Age"] < 30)]["Survived"].mean()*100

71.42857142857143